const stations = {
  "수영장": [500, 600],
  "보라보라": [500, 500],
  "공장지대": [500, 400],
  "중앙": [500, 300],
  "대네더포탈": [500, 200],
  "제마천": [500, 100],
  "라바치킨": [500, 0],
  "이천": [400, 0],
  "식준": [300, 0],
  "구이": [200, 0],
  "천이": [700, 270],
  "구도심": [600, 280],
  "대미사일발사대": [400, 280],
  "중소미사일발사대": [300, 280],
  "화살발사대": [200, 280],
  "평야": [200, 200],
  "윈비트": [300, 100],
  "레이지": [600, -100],
  "아콧": [400, -100],
  "화살표적지": [200, 400],
  "공장입구": [350, 400],
  "공항": [650, 450],
  "나무": [-100, 100],
  "외각광역철도건설사업소": [0, 100],
  "천사천": [100, 100],
  "도년": [700, 500],
  "매끈": [700, 600],
  "철근": [700, 700],
  "스톤": [700, 800],
  "신리": [50, 350],
  "감자칩공장": [100, 400],
  "대운": [200, 450],
  "공항국제도시": [650, 400],
  "세신": [850, 400],
  "연재": [1000, 275],
  "다래": [1100, 200],
  "부영": [1100, 0],
  "유곽입구": [600, 600],
  "유곽뿔": [300, 600],
  "유곽요판": [100, 600],
  "밀랍칠한약간녹슨깍인구리반블록": [0, 500],
  "엔더아이즈": [0, 350],
  "랜덤다이징": [0, 200],
  "미북": [650, 320],
  "대명": [550, 200],
  "미리내": [550, 100],
  "공항화물청사": [650, 100],
  "팔시티외곽": [750, 100],
  "팔시티파크": [600, -250],
  "팔시티성월": [600, -400],
  "팔시티시청": [600, -500],
  "팔시티공항": [700, -500],
  "에메랄드아파트단지 4차,5차,6차": [-200, 500],
  "에메랄드블록광산아파트단지 1차,2차,3차": [-100, 500],
  "민트": [100, 280],
  "폭격의악마": [300, 200],
  "토양": [600, 0],
  "팔시티팔시": [650, -250],
  "라바치킨제공공장": [500, -100],
  "구천": [750, 200],
  "팔팔이": [750, 350],
  "알지비": [550, 500],
  "캐럿팜": [-100, 250],
  "제성": [300, -100],
  "기지": [520, 320],
  "열차대학교": [550, 330],
  "신도시": [580, 325],
  "열차대학교입구": [480, 315],
  "도심고등학교": [600, 320],
  "각원": [600, 345],
  "북마을": [550, 310],
  "공장물류화물센터": [550, 380],
  "국가발전산업단지": [700, 825],
  "서산": [-1000, 300],
  "서부입구": [-700, 300],
  "북신리": [50, 300],
  "동부입구": [1100, 300],
  "도서": [1600, 300],
  "서린": [-1000, -1000],
  "서안": [-1000, -600],
  "서평": [-1000, -200],
  "서산남부": [-1000, 500],
  "서월": [-1000, 1000],
  "폭서": [-1000, 1500],
  "서관": [-600, 1500],
  "남부도서관": [500, 1500],
  "외곽": [1500, 1500],
  "팔시티": [500, -500],
  "화북": [500, -1200],
  "유곽": [500, 1000],
  "남부": [1200, 1000],
  "동영": [1200, 600],
  "경선": [1200, -100],
  "북동": [1200, -1000],
  "북시티": [1200, -1400],
  "북정": [1000, -1300],
  "팔시티능술": [200, -900],
  "용호": [50, 1300],
  "남부외곽": [180, 520],
  "팔시티종합환승센터": [500, -600],
  "북림": [-200, -1200],
  "팔시티남부": [500, -250],
  "팔시티공장": [500, -400],
  "팔시티북부법원": [500, -700],
  "팔시티북부": [500, -800],
  "팔시티서편": [100, -500],
  "팔시티서부중앙": [200, -500],
  "팔시티서부입구": [300, -500],
  "팔시티서부도시철도사업소": [400, -500],
  "기시": [800, -500],
  "빅엔드": [900, -500],
  "국천계단": [1000, -500],
  "팔시티인각": [600, -800],
  "팔시티지행": [700, -800],
  "팔시티단할": [750, -650],
  "팔시티동편": [750, -550],
  "팔시티요새": [750, -350],
  "팔시티팥팔": [700, -250],
  "팔시티간교": [400, -250],
  "팔시티연탁": [300, -250],
  "팔시티운정": [200, -250],
  "팔시티선학": [100, -350],
  "팔시티객원": [100, -700],
  "팔시티구절": [100, -800],
  "팔시티정백": [200, -800],
  "팔시티전물": [350, -800],
  "팔시티간청": [200, -700],
  "팔시티복각": [200, -600],
  "팔시티호판": [700, -350],
  "유곽지하철운영건설사업소": [500, 700],
  "유곽국제업무단지": [500, 800],
  "유곽도심데이터센터": [500, 900],
  "유곽남부터미널": [500, 1100],
  "유곽남부청": [500, 1200],
  "유곽미디어센터": [500, 1270],
  "유곽외곽입구": [500, 1350],
  "외곽대환승센터": [500, 1450],
  "유곽중앙시청": [550, 1000],
  "유곽정보통신센터": [600, 1000],
  "유곽금융중심지": [650, 1000],
  "유곽도시안전센터": [700, 1000],
  "유곽동부": [750, 1000],
  "외곽공항입구": [800, 1000],
  "명천": [1500, 1100],
  "금천": [1500, 1166],
  "가연": [1500, 1288],
  "노겸": [1500, 1400],
  "학세": [1500, 1600],
  "산식": [1500, 1700],
  "무병": [1500, 1800],
  "독세": [1400, 1520],
  "팔천부터미널": [1250, 1520],
  "단내": [1100, 1520],
  "남남동": [950, 1520],
  "청운": [725, 1520],
  "삼덕": [650, 1520],
  "시톤": [550, 1520],
  "남천": [800, 1096],
  "아크": [800, 1192],
  "팔천": [800, 1288],
  "조신": [800, 1384],
  "백운": [800, 1520],
  "우주": [900, 1288],
  "이사": [1050, 1288],
  "서영": [1200, 1288],
  "도원": [1350, 1288],
  "북동시국천구청": [1050, -625],
  "북동시기차환승센터": [1100, -750],
  "북동시지상철도사업소": [1150, -875],
  "북동시북동구철도건설사업소": [1225, -1075],
  "북동시영화관": [1275, -1200],
  "북동시입구": [1325, -1325],
  "동북초대형감자공장": [1484, -1112],
  "동북지하차도": [1413, -1084],
  "동북공장단지": [1342, -1056],
  "동북시주택단지": [1271, -1028],
  "동북시아파트단지": [1129, -972],
  "북동시자유게시판": [1058, -944],
  "북동시점프맵단지": [987, -916],
  "북동시팔시티환승센터": [916, -888],
  "팔시티북동부": [845, -860],
  "공명": [1200, -1600],
  "산탄": [1200, -1500],
  "전당": [1300, -1400],
  "회진": [1400, -1400],
  "북시티대학교입구": [1500, -1400],
  "엑스포": [1600, -1400],
  "동영시청": [1150, 600],
  "동영국제공항": [1150, 700],
  "북동영": [1150, 525],
  "북구중앙": [1150, 450],
  "북구차량기지": [1150, 350],
  "서부차량기지": [800, 650],
  "서부공업단지": [900, 650],
  "서부주거단지": [1000, 650],
  "동영출구": [1050, 650],
  "하림": [970, 760],
  "중리": [885, 880],
  "중앙광장": [1100, 625],
  "구시가지": [1300, 650],
  "동영마트": [1400, 650],
  "동부공장": [1500, 650],
  "동부신도시": [1600, 650],
  "동부비즈니스파크": [1700, 650],
  "동부주거단지": [1800, 650],
  "동부종점": [1900, 650],
  "서안신도시": [-860, -600],
  "서산테크노밸리": [-820, 420],
  "서평신도시": [-860, -180],
  "서월신도시": [-860, 1080],
  "서월호수공원": [-860, 1220],
  "폭서항": [-1120, 1650],
  "유곽마을": [250, 720],
  "극계": [400, 840],
  "오류": [1200, -550]
};


const station_data = {
  "1호선": {
    "color": [0, 0, 1, 1],
    "stations": ["수영장", "보라보라", "공장지대", "중앙", "대네더포탈", "제마천", "라바치킨", "이천", "식준", "구이"]
  },
  "2호선": {
    "color": [0, 1, 0, 1],
    "stations": ["천이", "구도심", "중앙", "대미사일발사대", "중소미사일발사대", "화살발사대", "평야", "윈비트", "라바치킨", "레이지"]
  },
  "3호선": {
    "color": [1, 0.54, 0.05, 1],
    "stations": ["공항", "공장지대", "공장입구", "화살표적지", "화살발사대", "평야", "윈비트", "라바치킨", "아콧"]
  },
  "4호선": {
    "color": [0.49, 0.72, 1, 1],
    "stations": ["나무", "외각광역철도건설사업소", "천사천", "윈비트", "구도심", "공항", "도년", "매끈", "철근", "스톤"]
  },
  "5호선": {
    "color": [0.15, 0.25, 0, 1],
    "stations": ["부영", "다래", "연재", "세신", "공항국제도시", "공장지대", "공장입구", "대운", "감자칩공장", "신리"]
  },
  "6호선": {
    "color": [0.23, 0.11, 0, 1],
    "stations": ["철근", "유곽입구", "수영장", "유곽뿔", "유곽요판", "밀랍칠한약간녹슨깍인구리반블록", "엔더아이즈", "랜덤다이징", "외각광역철도건설사업소", "구이"]
  },
  "7호선": {
    "color": [0.55, 0, 1, 1],
    "stations": ["공장지대", "미북", "천이", "대명", "대네더포탈", "미리내", "공항화물청사", "팔시티외곽", "레이지", "팔시티파크", "팔시티성월", "팔시티시청", "팔시티공항"]
  },
  "8호선": {
    "color": [1, 0.48, 0.66, 1],
    "stations": ["에메랄드아파트단지 4차,5차,6차", "에메랄드블록광산아파트단지 1차,2차,3차", "밀랍칠한약간녹슨깍인구리반블록", "감자칩공장", "민트", "화살발사대", "폭격의악마", "대네더포탈", "미리내", "토양", "레이지", "팔시티팔시"]
  },
  "중앙권순환철도": {
    "color": [1, 0, 0, 1],
    "is_loop": true,
    "stations": ["라바치킨제공공장", "레이지", "공항화물청사", "구천", "팔팔이", "공항", "알지비", "보라보라", "감자칩공장", "엔더아이즈", "캐럿팜", "나무", "구이", "제성", "아콧", "라바치킨제공공장"]
  },
  "신도시경전철": {
    "color": [0.49, 0.49, 0.49, 1],
    "stations": ["중앙", "기지", "열차대학교", "신도시", "공항"]
  },
  "트램": {
    "color": [0.73, 0, 0, 1],
    "stations": ["중앙", "열차대학교입구", "기지", "신도시", "각원"]
  },
  "트램지선": {
    "color": [0.73, 0, 0, 1],
    "stations": ["기지", "구도심", "도심고등학교"]
  },
  "국가산업선": {
    "color": [0.12, 0.12, 0, 1],
    "stations": ["북마을", "열차대학교", "공장물류화물센터", "공장지대", "알지비", "유곽입구", "철근", "스톤", "국가발전산업단지"]
  },
  "팔시티1호선": {
    "color": [0, 0.176, 0.38, 1],
    "stations": ["라바치킨", "라바치킨제공공장", "팔시티남부", "팔시티공장", "팔시티", "팔시티종합환승센터", "팔시티북부법원", "팔시티북부"]
  },
  "팔시티2호선": {
    "color": [0.055, 0.329, 0.349, 1],
    "stations": ["팔시티서편", "팔시티서부중앙", "팔시티서부입구", "팔시티서부도시철도사업소", "팔시티", "팔시티시청", "팔시티공항", "기시", "빅엔드", "국천계단"]
  },
  "팔시티3호선": {
    "color": [0.776, 0.776, 0.212, 1],
    "is_loop": true,
    "stations": ["팔시티북부", "팔시티인각", "팔시티지행", "팔시티단할", "팔시티동편", "팔시티요새", "팔시티팥팔", "팔시티팔시", "팔시티파크", "팔시티남부", "팔시티간교", "팔시티연탁", "팔시티운정", "팔시티선학", "팔시티서편", "팔시티객원", "팔시티구절", "팔시티정백", "팔시티전물", "팔시티북부"]
  },
  "팔시티4호선": {
    "color": [0.153, 0.302, 0, 1],
    "stations": ["팔시티능술", "팔시티정백", "팔시티간청", "팔시티복각", "팔시티서부입구", "팔시티", "팔시티호판", "팔시티팥팔", "팔시티외곽", "구천", "미북"]
  },
  "유곽1호선": {
    "color": [0.361, 0.533, 0.071, 1],
    "stations": ["수영장", "유곽지하철운영건설사업소", "유곽국제업무단지", "유곽도심데이터센터", "유곽", "유곽남부터미널", "유곽남부청", "유곽미디어센터", "유곽외곽입구", "외곽대환승센터", "남부도서관"]
  },
  "유곽2호선": {
    "color": [1, 0.859, 0.545, 1],
    "stations": ["유곽", "유곽중앙시청", "유곽정보통신센터", "유곽금융중심지", "유곽도시안전센터", "유곽동부", "외곽공항입구"]
  },
  "외곽1호선": {
    "color": [0.196, 0.212, 0.110, 1],
    "stations": ["명천", "금천", "가연", "노겸", "외곽", "학세", "산식", "무병"]
  },
  "외곽1호선지선": {
    "color": [0.196, 0.212, 0.110, 1],
    "stations": ["외곽", "독세", "팔천부터미널", "단내", "남남동", "백운", "청운", "삼덕", "시톤", "남부도서관"]
  },
  "외곽2호선": {
    "color": [0.788, 0.118, 0.345, 1],
    "stations": ["외곽공항입구", "남천", "아크", "팔천", "조신", "백운"]
  },
  "외곽3호선": {
    "color": [1, 0.671, 0, 1],
    "stations": ["가연", "도원", "서영", "이사", "우주", "팔천"]
  },
  "북동1호선": {
    "color": [0.082, 0.933, 0.694, 1],
    "stations": ["국천계단", "북동시국천구청", "북동시기차환승센터", "북동시지상철도사업소", "북동", "북동시북동구철도건설사업소", "북동시영화관", "북동시입구"]
  },
  "북동2호선": {
    "color": [0.937, 0.745, 0.737, 1],
    "stations": ["동북초대형감자공장", "동북지하차도", "동북공장단지", "동북시주택단지", "북동", "동북시아파트단지", "북동시자유게시판", "북동시점프맵단지", "북동시팔시티환승센터", "팔시티북동부", "팔시티지행"]
  },
  "북시티1호선": {
    "color": [1, 0, 0, 1],
    "stations": ["공명", "산탄", "북시티", "전당", "회진", "북시티대학교입구", "엑스포"]
  },
  "동영1호선": {
    "color": [1, 0, 0, 1],
    "stations": ["동영국제공항", "동영시청", "북동영", "북구중앙", "북구차량기지", "동부입구"]
  },
  "동영2호선": {
    "color": [1, 0.82, 0, 1],
    "stations": ["서부차량기지", "서부공업단지", "서부주거단지", "동영출구", "중앙광장", "동영시청", "동영", "구시가지", "동영마트", "동부공장", "동부신도시", "동부비즈니스파크", "동부주거단지", "동부종점"]
  },
  "동영2호선지선": {
    "color": [1, 0.82, 0, 1],
    "stations": ["동영출구", "하림", "중리", "외곽공항입구", "남천", "아크", "팔천"]
  },
  "JDX": {
    "color": [1, 1, 0, 1],
    "stations": ["서산", "서부입구", "북신리", "중앙", "동부입구", "도서"]
  },
  "WSX": {
    "color": [0.52, 0, 1, 1],
    "stations": ["서린", "서안", "서평", "서산", "서산남부", "서월", "폭서", "서관", "남부도서관", "외곽"]
  },
  "YPX": {
    "color": [0.11, 0.4, 0.65, 1],
    "stations": ["화북", "팔시티", "중앙", "수영장", "유곽", "남부도서관"]
  },
  "DDS": {
    "color": [0, 1, 0.87, 1],
    "stations": ["북시티", "북동", "경선", "동영", "남부", "외곽"]
  },
  "DPX": {
    "color": [0.0235, 0.7216, 0.8118, 1],
    "stations": ["팔시티", "팔시티외곽", "동부입구", "동영", "남부", "외곽"]
  },
  "BSS": {
    "color": [0.314, 0.71, 0.941, 1],
    "stations": ["북시티", "북정", "화북", "팔시티능술", "북신리", "용호", "남부도서관", "외곽"]
  },
  "NSL지선": {
    "color": [0.698, 0.133, 0.133, 1],
    "stations": ["구도심", "연재", "동영"]
  },
  "NSL": {
    "color": [0.698, 0.133, 0.133, 1],
    "stations": ["팔시티능술", "팔시티종합환승센터", "팔시티", "구도심", "수영장"]
  },
  "OBR": {
    "color": [1, 0.412, 0.706, 1],
    "is_loop": true,
    "stations": ["외곽", "남부도서관", "서관", "폭서", "서월", "서산남부", "서산", "서평", "서안", "서린", "북림", "화북", "북정", "북시티", "북동", "경선", "동영", "남부", "외곽"]
  },
  "유신선": {
    "color": [0.12, 0.45, 1, 1],
    "stations": ["신리", "감자칩공장", "남부외곽", "유곽뿔", "유곽지하철운영건설사업소", "유곽", "유곽금융중심지"]
  },
  "9호선": {
    "color": [0.92, 0.74, 0.16, 1],
    "stations": ["팔시티서편", "팔시티선학", "구이", "평야", "화살발사대", "감자칩공장", "남부외곽", "유곽요판", "유곽마을", "극계"]
  },
  "9호선지선": {
    "color": [0.92, 0.74, 0.16, 1],
    "stations": ["외곽공항입구", "스톤", "유곽입구", "보라보라", "공장입구", "화살발사대", "평야", "윈비트", "이천", "라바치킨제공공장", "팔시티파크", "팔시티성월", "팔시티시청", "팔시티공항"]
  },
  "WDX": {
    "color": [0.2, 0.8, 0.4, 1],
    "planned": true,
    "stations": ["서월호수공원", "서월신도시", "서월", "서산남부", "서산테크노밸리", "서산", "서평신도시", "서평", "서안신도시"]
  },
  "10호선": {
    "color": [0.4, 0.2, 0.8, 1],
    "planned": true,
    "stations": [
      "구이",
      "제성",
      "라바치킨",
      "미리내",
      "중앙",
      "구도심",
      "공항",
      "도년",
      "매끈",
      "철근"
    ]
  },
  "12호선": {
    "color": [0.8, 0.4, 0.2, 1],
    "planned": true,
    "stations": [
      "대명",
      "열차대학교",
      "신도시",
      "미북",
      "공항국제도시",
      "공항",
      "도년",
      "매끈",
      "철근",
      "스톤"
    ]
  }
};