const stations = {
  // --- [중앙 도심지구] ---
  "중앙": [500, 300, "중앙"],
  "공장지대": [500, 400, "중앙"],
  "대네더포탈": [500, 200, "중앙"],
  "제마천": [500, 100, "중앙"],
  "라바치킨": [500, 0, "중앙"],
  "이천": [400, 0, "중앙"],
  "식준": [300, 0, "중앙"],
  "구이": [200, 0, "중앙"],
  "천이": [700, 270, "중앙"],
  "구도심": [600, 280, "중앙"],
  "스폰": [400, 280, "중앙"],
  "중소미사일발사대": [300, 280, "중앙"],
  "화살발사대": [200, 280, "중앙"],
  "평야": [200, 200, "중앙"],
  "윈비트": [300, 100, "중앙"],
  "화살표적지": [200, 400, "중앙"],
  "공장입구": [350, 400, "중앙"],
  "공항": [650, 450, "중앙"],
  "나무": [-100, 100, "중앙"],
  "외각광역철도건설사업소": [0, 100, "중앙"],
  "천사천": [100, 100, "중앙"],
  "신리": [50, 350, "중앙"],
  "감자칩공장": [100, 400, "중앙"],
  "엔더아이즈": [0, 350, "중앙"],
  "랜덤다이징": [0, 200, "중앙"],
  "미북": [650, 320, "중앙"],
  "대명": [550, 200, "중앙"],
  "미리내": [550, 100, "중앙"],
  "민트": [100, 280, "중앙"],
  "폭격의악마": [300, 200, "중앙"],
  "캐럿팜": [-100, 250, "중앙"],
  "기지": [520, 320, "중앙"],
  "열차대학교": [550, 330, "중앙"],
  "신도시": [580, 325, "중앙"],
  "열차대학교입구": [480, 315, "중앙"],
  "도심고등학교": [600, 320, "중앙"],
  "각원": [600, 345, "중앙"],
  "북마을": [550, 310, "중앙"],
  "공장물류화물센터": [550, 380, "중앙"],
  "북신리": [50, 300, "중앙"],
  "공항국제도시": [650, 400, "중앙"],
  "팔팔이": [750, 350, "중앙"],
  "도년": [700, 500, "중앙"],
  "매끈": [700, 600, "중앙"],
  "세신": [800, 400, "중앙"],
  "연재": [900, 400, "중앙"],
  "다래": [1000, 350, "중앙"],
  "부영": [1000, 200, "중앙"],
  "레이지": [600, -100, "중앙"],
  "아콧": [400, -100, "중앙"],
  "토양": [600, 0, "중앙"],
  "라바치킨제공공장": [500, -100, "중앙"],
  "공항화물청사": [650, 100, "중앙"],
  "구천": [750, 200, "중앙"],
  "제성": [300, -100, "중앙"],
  "수영장": [500, 600, "중앙"],
  "보라보라": [500, 500, "중앙"],
  "알지비": [550, 500, "중앙"],
  "대운": [200, 450, "중앙"],
  "밀랍칠한약간녹슨깍인구리반블록": [0, 500, "중앙"],
  "남부외곽": [180, 520, "중앙"],
  "오류": [675, -170, "중앙"],
  "남부오류": [750, 50, "중앙"],
  "에메랄드아파트단지 4차,5차,6차": [-200, 500, "중앙"],
  "에메랄드블록광산아파트단지 1차,2차,3차": [-100, 500, "중앙"],
  "중앙도로관리사무소": [600, 600, "중앙"],
  "자동농장": [-350, 250, "중앙"],
  "폭탄공장": [-200, 250, "중앙"],

  // --- [팔시티 광역특별시] ---
  "팔시티": [500, -500, "팔시티"],
  "팔시티종합환승센터": [500, -600, "팔시티"],
  "팔시티시청": [600, -500, "팔시티"],
  "팔시티공항": [700, -500, "팔시티"],
  "팔시티파크": [600, -250, "팔시티"],
  "팔시티성월": [600, -400, "팔시티"],
  "팔시티팔시": [650, -250, "팔시티"],
  "팔시티능술": [200, -900, "팔시티"],
  "팔시티남부": [500, -250, "팔시티"],
  "팔시티공장": [500, -400, "팔시티"],
  "팔시티북부법원": [500, -700, "팔시티"],
  "팔시티북부": [500, -800, "팔시티"],
  "팔시티서편": [100, -500, "팔시티"],
  "팔시티서부중앙": [200, -500, "팔시티"],
  "팔시티서부입구": [300, -500, "팔시티"],
  "팔시티서부도시철도사업소": [400, -500, "팔시티"],
  "기시": [800, -500, "팔시티"],
  "빅엔드": [900, -500, "팔시티"],
  "국천계단": [1000, -500, "팔시티"],
  "팔시티인각": [600, -800, "팔시티"],
  "팔시티지행": [700, -800, "팔시티"],
  "팔시티단할": [750, -650, "팔시티"],
  "팔시티동편": [750, -550, "팔시티"],
  "팔시티요새": [750, -350, "팔시티"],
  "팔시티팥팔": [700, -250, "팔시티"],
  "팔시티간교": [400, -250, "팔시티"],
  "팔시티연탁": [300, -250, "팔시티"],
  "팔시티운정": [200, -250, "팔시티"],
  "팔시티선학": [100, -350, "팔시티"],
  "팔시티객원": [100, -700, "팔시티"],
  "팔시티구절": [100, -800, "팔시티"],
  "팔시티정백": [200, -800, "팔시티"],
  "팔시티전물": [350, -800, "팔시티"],
  "팔시티간청": [200, -700, "팔시티"],
  "팔시티복각": [200, -600, "팔시티"],
  "팔시티호판": [700, -350, "팔시티"],

  // --- [유곽 특별지구] ---
  "유곽": [500, 1000, "유곽"],
  "유곽뿔": [300, 600, "유곽"],
  "유곽요판": [100, 600, "유곽"],
  "철근": [700, 700, "유곽"],
  "스톤": [700, 800, "유곽"],
  "국가발전산업단지": [700, 825, "유곽"],
  "유곽지하철운영건설사업소": [500, 700, "유곽"],
  "유곽국제업무단지": [500, 800, "유곽"],
  "유곽도심데이터센터": [500, 900, "유곽"],
  "유곽남부터미널": [500, 1100, "유곽"],
  "유곽남부청": [500, 1200, "유곽"],
  "유곽미디어센터": [500, 1270, "유곽"],
  "유곽중앙시청": [550, 1000, "유곽"],
  "유곽정보통신센터": [600, 1000, "유곽"],
  "유곽금융중심지": [650, 1000, "유곽"],
  "유곽도시안전센터": [700, 1000, "유곽"],
  "유곽동부": [750, 1000, "유곽"],
  "유곽마을": [250, 720, "유곽"],
  "극계": [400, 840, "유곽"],

  // --- [동영 행정지구] ---
  "동영": [1200, 600, "동영"],
  "동영시청": [1150, 600, "동영"],
  "동영국제공항": [1150, 700, "동영"],
  "북동영": [1150, 525, "동영"],
  "북구중앙": [1150, 450, "동영"],
  "북구차량기지": [1150, 350, "동영"],
  "동부입구": [1100, 300, "동영"],
  "서부차량기지": [800, 650, "동영"],
  "서부공업단지": [900, 650, "동영"],
  "서부주거단지": [1000, 650, "동영"],
  "동영출구": [1050, 650, "동영"],
  "하림": [970, 760, "동영"],
  "중리": [885, 880, "동영"],
  "중앙광장": [1100, 625, "동영"],
  "구시가지": [1300, 650, "동영"],
  "동영마트": [1400, 650, "동영"],
  "남부": [1200, 1000, "동영"],
  
  "동부공장": [1500, 650, "도서"],
  "동부신도시": [1600, 650, "도서"],
  "동부비즈니스파크": [1700, 650, "도서"],
  "동부주거단지": [1800, 650, "도서"],
  "동부종점": [1900, 650, "도서"],
  "동영바이오밸리": [1400, 750, "동영"],
  "동영콘텐츠허브": [1400, 850, "동영"],
  "동영수변공원": [1400, 950, "동영"],
  "동영컬처타운": [1300, 950, "동영"],
  "동영스타트업밸리": [1250, 950, "동영"],

  // --- [서산/폭서 신도시권] ---
  "서산": [-1000, 300, "서산"],
  "서부입구": [-700, 300, "서산"],
  "서원": [-800, 100, "서산"],
  "서폴": [-900, -100, "서산"],
  "서평": [-1000, -200, "서산"],
  "서부서평": [-1140, -400, "서산"],
  "서부서평연구소": [-1300, -200, "서산"],
  "서생": [-1300, 500, "서산"],
  "서부서산": [-1300, 100, "서산"],
  "동부서산": [-820, 420, "서산"],
  "서산남부": [-1000, 500, "서산"],
  "서철": [-1300, 750, "서산"],
  "서평신도시": [-860, -180, "서산"],
  "서철동부": [-1100, 700, "서산"],
  "서산광장": [-1150, 200, "서산"],
  "서산테크노": [-1200, -100, "서산"],
  "서산입구": [-960, 400, "서산"],

  "서린": [-1000, -1000, "서린"],
  "서안": [-1000, -600, "서린"],
  "서산공장": [-1150, 520, "서산"],
  "서원서부": [-900, 200, "서산"],
  "서굴": [-920, -350, "서산"],
  "서산출구": [-550, 250, "서산"],


  
  "폭서": [-1000, 1500, "폭서"],
  "서월": [-1000, 1000, "폭서"],
  "서관": [-600, 1500, "폭서"],
  "용호": [50, 1300, "폭서"],

  // --- [화북/북동 산업단지] ---
  "화북": [500, -1200, "화북"],
  "북동": [1200, -1000, "북동"],
  "북시티": [1200, -1400, "북시티"],
  "북정": [1000, -1300, "화북"],
  "북림": [-200, -1200, "화북"],
  "북동시국천구청": [1050, -625, "북동"],
  "북동시기차환승센터": [1100, -750, "북동"],
  "북동시지상철도사업소": [1150, -875, "북동"],
  "북동시북동구철도건설사업소": [1225, -1075, "북동"],
  "북동시영화관": [1275, -1200, "북동"],
  "북동시입구": [1325, -1325, "북동"],
  "동북초대형감자공장": [1484, -1112, "북동"],
  "동북지하차도": [1413, -1084, "북동"],
  "동북공장단지": [1342, -1056, "북동"],
  "동북시주택단지": [1271, -1028, "북동"],
  "동북시아파트단지": [1129, -972, "북동"],
  "북동시자유게시판": [1058, -944, "북동"],
  "북동시점프맵단지": [987, -916, "북동"],
  "북동시팔시티환승센터": [916, -888, "북동"],
  "팔시티북동부": [845, -860, "북동"],
  "공명": [1200, -1600, "북시티"],
  "산탄": [1200, -1500, "북시티"],
  "전당": [1300, -1400, "북시티"],
  "회진": [1400, -1400, "북시티"],
  "북시티대학교입구": [1500, -1400, "북시티"],
  "엑스포": [1600, -1400, "북시티"],
  "북시티신도시": [1300, -1700, "북시티"],
  "북시티테크광장": [1400, -1700, "북시티"],
  "북시티미디어": [1450, -1650, "북시티"],
  "북시티문화센터": [1500, -1600, "북시티"],
  "북시티스퀘어": [1550, -1550, "북시티"],
  "북시티리버파크": [1600, -1500, "북시티"],
  "북동테크노파크": [1600, -1450, "북시티"],

  // --- [경선/경인 관문지구] ---
  "경선": [1200, -100, "경선"],
  "경선신도심": [1300, -100, "경선"],
  "경선디지털파크": [1400, -100, "경선"],
  "경선연구단지": [1500, -100, "경선"],
  "경선메트로센터": [1600, -100, "경선"],
  "경선플랫폼": [1700, -100, "경선"],
  "경선동": [1100, -100, "경선"],
  "경선메디컬파크": [1100, -140, "경선"],
  "경선수변센터": [1060, -180, "경선"],
  "경선터미널": [1020, -220, "경선"],

  "오류동부": [800, -350, "경인"],
  "경인테크": [825, -300, "경인"],
  "경인신도시": [875, -200, "경인"],
  "경인": [900, -100, "경인"],
  "경인시청": [1000, -100, "경인"],
  "경인리버사이드": [940, -140, "경인"],
  "경인지식단지": [960, -220, "경인"],
  "경인테크시티": [960, -250, "경인"],
  "경인창업밸리": [960, -300, "경인"],
  "경인광역터미널": [900, -350, "경인"],

  // --- [남부도서관/외곽구역] ---
  "도서": [1600, 300, "도서"],
  "외곽": [1500, 1500, "외곽"],
  "유곽외곽입구": [500, 1350, "외곽"],
  "외곽대환승센터": [500, 1450, "외곽"],
  "시톤": [550, 1520, "외곽"],
  "남부도서관": [500, 1500, "외곽"],
  "외곽공항입구": [800, 1000, "외곽"],
  "명천": [1500, 1100, "외곽"],
  "금천": [1500, 1166, "외곽"],
  "가연": [1500, 1288, "외곽"],
  "노겸": [1500, 1400, "외곽"],
  "학세": [1500, 1600, "외곽"],
  "산식": [1500, 1700, "외곽"],
  "무병": [1500, 1800, "외곽"],
  "독세": [1400, 1520, "외곽"],
  "팔천부터미널": [1250, 1520, "외곽"],
  "단내": [1100, 1520, "외곽"],
  "남남동": [950, 1520, "외곽"],
  "청운": [725, 1520, "외곽"],
  "삼덕": [650, 1520, "외곽"],
  "남천": [800, 1096, "외곽"],
  "아크": [800, 1192, "외곽"],
  "팔천": [800, 1288, "외곽"],
  "조신": [800, 1384, "외곽"],
  "백운": [800, 1520, "외곽"],
  "우주": [900, 1288, "외곽"],
  "이사": [1050, 1288, "외곽"],
  "서영": [1200, 1288, "외곽"],
  "도원": [1350, 1288, "외곽"],
};

const station_data = {
  "1호선": {
    "color": [0, 0, 1, 1],
    "stations": ["수영장", "보라보라", "공장지대", "중앙", "대네더포탈", "제마천", "라바치킨", "이천", "식준", "구이"]
  },
  "2호선": {
    "color": [0, 1, 0, 1],
    "stations": ["천이", "구도심", "중앙", "스폰", "중소미사일발사대", "화살발사대", "평야", "윈비트", "라바치킨", "레이지"]
  },
  "3호선": {
    "color": [1, 0.54, 0.05, 1],
    "stations": ["공항", "공장지대", "공장입구", "화살표적지", "화살발사대", "평야", "윈비트", "라바치킨", "아콧"]
  },
  "4호선": {
    "color": [0.49, 0.72, 1, 1],
    "stations": ["나무", "외각광역철도건설사업소", "천사천", "윈비트", "구도심", "공항", "도년", "매끈", "철근", "스톤"]
  },
  "5호선": {
    "color": [0.15, 0.25, 0, 1],
    "stations": ["부영", "다래", "연재", "세신", "공항국제도시", "공장지대", "공장입구", "대운", "감자칩공장", "신리"]
  },
  "6호선": {
    "color": [0.23, 0.11, 0, 1],
    "stations": ["철근", "중앙도로관리사무소", "수영장", "유곽뿔", "유곽요판", "밀랍칠한약간녹슨깍인구리반블록", "엔더아이즈", "랜덤다이징", "외각광역철도건설사업소", "구이"]
  },
  "7호선": {
    "color": [0.55, 0, 1, 1],
    "stations": ["공장지대", "미북", "천이", "대명", "대네더포탈", "미리내", "공항화물청사", "남부오류", "레이지", "팔시티파크", "팔시티성월", "팔시티시청", "팔시티공항"]
  },
  "8호선": {
    "color": [1, 0.48, 0.66, 1],
    "stations": ["에메랄드아파트단지 4차,5차,6차", "에메랄드블록광산아파트단지 1차,2차,3차", "밀랍칠한약간녹슨깍인구리반블록", "감자칩공장", "민트", "화살발사대", "폭격의악마", "대네더포탈", "미리내", "토양", "레이지", "팔시티팔시"]
  },
  "중앙권순환철도": {
    "color": [1, 0, 0, 1],
    "is_loop": true,
    "stations": ["라바치킨제공공장", "레이지", "공항화물청사", "구천", "팔팔이", "공항", "알지비", "보라보라", "감자칩공장", "엔더아이즈", "캐럿팜", "나무", "구이", "제성", "아콧", "라바치킨제공공장"]
  },
  "신도시경전철": {
    "color": [0.49, 0.49, 0.49, 1],
    "stations": ["중앙", "기지", "열차대학교", "신도시", "공항"]
  },
  "트램": {
    "color": [0.73, 0, 0, 1],
    "stations": ["중앙", "열차대학교입구", "기지", "신도시", "각원"]
  },
  "트램지선": {
    "color": [0.73, 0, 0, 1],
    "stations": ["기지", "구도심", "도심고등학교"]
  },
  "국가산업선": {
    "color": [0.12, 0.12, 0, 1],
    "stations": ["북마을", "열차대학교", "공장물류화물센터", "공장지대", "알지비", "중앙도로관리사무소", "철근", "스톤", "국가발전산업단지"]
  },
  "팔시티1호선": {
    "color": [0, 0.176, 0.38, 1],
    "stations": ["라바치킨", "라바치킨제공공장", "팔시티남부", "팔시티공장", "팔시티", "팔시티종합환승센터", "팔시티북부법원", "팔시티북부"]
  },
  "팔시티2호선": {
    "color": [0.055, 0.329, 0.349, 1],
    "stations": ["팔시티서편", "팔시티서부중앙", "팔시티서부입구", "팔시티서부도시철도사업소", "팔시티", "팔시티시청", "팔시티공항", "기시", "빅엔드", "국천계단"]
  },
  "팔시티3호선": {
    "color": [0.776, 0.776, 0.212, 1],
    "is_loop": true,
    "stations": ["팔시티북부", "팔시티인각", "팔시티지행", "팔시티단할", "팔시티동편", "팔시티요새", "팔시티팥팔", "팔시티팔시", "팔시티파크", "팔시티남부", "팔시티간교", "팔시티연탁", "팔시티운정", "팔시티선학", "팔시티서편", "팔시티객원", "팔시티구절", "팔시티정백", "팔시티전물", "팔시티북부"]
  },
  "팔시티4호선": {
    "color": [0.153, 0.302, 0, 1],
    "stations": ["팔시티능술", "팔시티정백", "팔시티간청", "팔시티복각", "팔시티서부입구", "팔시티", "팔시티호판", "팔시티팥팔", "남부오류", "구천", "미북"]
  },
  "유곽1호선": {
    "color": [0.361, 0.533, 0.071, 1],
    "stations": ["수영장", "유곽지하철운영건설사업소", "유곽국제업무단지", "유곽도심데이터센터", "유곽", "유곽남부터미널", "유곽남부청", "유곽미디어센터", "유곽외곽입구", "외곽대환승센터", "남부도서관"]
  },
  "유곽2호선": {
    "color": [1, 0.859, 0.545, 1],
    "stations": ["유곽", "유곽중앙시청", "유곽정보통신센터", "유곽금융중심지", "유곽도시안전센터", "유곽동부", "외곽공항입구"]
  },
  "외곽1호선": {
    "color": [0.196, 0.212, 0.110, 1],
    "stations": ["명천", "금천", "가연", "노겸", "외곽", "학세", "산식", "무병"]
  },
  "외곽1호선지선": {
    "color": [0.196, 0.212, 0.110, 1],
    "stations": ["외곽", "독세", "팔천부터미널", "단내", "남남동", "백운", "청운", "삼덕", "시톤", "남부도서관"]
  },
  "외곽2호선": {
    "color": [0.788, 0.118, 0.345, 1],
    "stations": ["외곽공항입구", "남천", "아크", "팔천", "조신", "백운"]
  },
  "외곽3호선": {
    "color": [1, 0.671, 0, 1],
    "stations": ["가연", "도원", "서영", "이사", "우주", "팔천"]
  },
  "북동1호선": {
    "color": [0.082, 0.933, 0.694, 1],
    "stations": ["국천계단", "북동시국천구청", "북동시기차환승센터", "북동시지상철도사업소", "북동", "북동시북동구철도건설사업소", "북동시영화관", "북동시입구"]
  },
  "북동2호선": {
    "color": [0.937, 0.745, 0.737, 1],
    "stations": ["동북초대형감자공장", "동북지하차도", "동북공장단지", "동북시주택단지", "북동", "동북시아파트단지", "북동시자유게시판", "북동시점프맵단지", "북동시팔시티환승센터", "팔시티북동부", "팔시티지행"]
  },
  "북시티1호선": {
    "color": [1, 0, 0, 1],
    "stations": ["공명", "산탄", "북시티", "전당", "회진", "북시티대학교입구", "엑스포"]
  },
  "동영1호선": {
    "color": [1, 0, 0, 1],
    "stations": ["동영국제공항", "동영시청", "북동영", "북구중앙", "북구차량기지", "동부입구"]
  },
  "동영2호선": {
    "color": [1, 0.82, 0, 1],
    "stations": ["서부차량기지", "서부공업단지", "서부주거단지", "동영출구", "중앙광장", "동영시청", "동영", "구시가지", "동영마트", "동부공장", "동부신도시", "동부비즈니스파크", "동부주거단지", "동부종점"]
  },
  "동영2호선지선": {
    "color": [1, 0.82, 0, 1],
    "stations": ["동영출구", "하림", "중리", "외곽공항입구", "남천", "아크", "팔천"]
  },
  "서산순환선": {
    "color": [1,1,0,1],
    "is_loop":true,
    "stations": ["서철","서철동부","서산남부","동부서산","서부입구","서원","서폴","서평신도시","서평","서부서평","서부서평연구소","서부서산","서생","서철"]
  },
  "JDX": {
    "color": [1, 1, 0, 1],
    "stations": ["서산", "서부입구", "북신리", "중앙", "동부입구", "도서"]
  },
  "WSX": {
    "color": [0.52, 0, 1, 1],
    "stations": ["서린", "서안", "서평", "서산", "서산남부", "서월", "폭서", "서관", "남부도서관", "외곽"]
  },
  "YPX": {
    "color": [0.11, 0.4, 0.65, 1],
    "stations": ["화북", "팔시티", "중앙", "수영장", "유곽", "남부도서관"]
  },
  "DDS": {
    "color": [0, 1, 0.87, 1],
    "stations": ["북시티", "북동", "경선", "동영", "남부", "외곽"]
  },
  "DPX": {
    "color": [0.0235, 0.7216, 0.8118, 1],
    "stations": ["팔시티", "남부오류", "동부입구", "동영", "남부", "외곽"]
  },
  "BSS": {
    "color": [0.314, 0.71, 0.941, 1],
    "stations": ["북시티", "북정", "화북", "팔시티능술", "북신리", "용호", "남부도서관", "외곽"]
  },
  "NSL지선": {
    "color": [0.698, 0.133, 0.133, 1],
    "stations": ["구도심", "연재", "동영"]
  },
  "NSL": {
    "color": [0.698, 0.133, 0.133, 1],
    "stations": ["팔시티능술", "팔시티종합환승센터", "팔시티", "구도심", "수영장"]
  },
  "OBR": {
    "color": [1, 0.412, 0.706, 1],
    "is_loop": true,
    "stations": ["외곽", "남부도서관", "서관", "폭서", "서월", "서산남부", "서산", "서평", "서안", "서린", "북림", "화북", "북정", "북시티", "북동", "경선", "동영", "남부", "외곽"]
  },
  "유신선": {
    "color": [0.12, 0.45, 1, 1],
    "stations": ["신리", "감자칩공장", "남부외곽", "유곽뿔", "유곽지하철운영건설사업소", "유곽", "유곽금융중심지"]
  },
  "9호선": {
    "color": [0.92, 0.74, 0.16, 1],
    "stations": ["팔시티서편", "팔시티선학", "구이", "평야", "화살발사대", "감자칩공장", "남부외곽", "유곽요판", "유곽마을", "극계"]
  },
  "9호선지선": {
    "color": [0.92, 0.74, 0.16, 1],
    "stations": ["외곽공항입구", "스톤", "중앙도로관리사무소", "보라보라", "공장입구", "화살발사대", "평야", "윈비트", "이천", "라바치킨제공공장", "팔시티파크", "팔시티성월", "팔시티시청", "팔시티공항"]
  },
  "팔경선": {
    "color": [1, 0.5, 0, 1],
    "stations": [
      "팔시티",
      "팔시티호판",
      "팔시티요새",
      "오류동부",
      "경인테크",
      "경인신도시",
      "경인",
      "경인시청",
      "경선동",
      "경선"
    ]
  },
  "10호선": {
    "color": [0, 0.7, 0.3, 1],
    "stations": [
      "팔시티연탁",
      "제성",
      "라바치킨",
      "미리내",
      "제마천",
      "스폰",
      "공장입구",
      "유곽뿔"
    ]
  },
  "11호선": {
    "color": [0.7725, 0.2510, 0.2510, 1],
    "stations": [
      "팔시티팥팔",
      "오류",
      "레이지",
      "토양",
      "공항화물청사",
      "천이",
      "세신"
    ]
  },
  "12호선": {
    "color": [0, 0.4, 1, 1],
    "planned": true,
    "stations": [
      "미리내",
      "대명",
      "구도심",
      "신도시",
      "미북",
      "공항국제도시",
      "공항",
      "도년",
      "매끈",
      "서부차량기지",
      "서부공업단지"
    ]
  },
  "북시티2호선": {
    "color": [0.2, 0.6, 0.9, 1],
    "planned": true,
    "stations": [
      "공명",
      "북시티신도시",
      "북시티테크광장",
      "북시티미디어",
      "북시티문화센터",
      "북시티스퀘어",
      "북시티리버파크",
      "북동테크노파크"
    ]
  },
  "동영3호선": {
    "color": [0.85, 0.15, 0.5, 1],
    "planned": true,
    "stations": [
      "동영마트",
      "동영바이오밸리",
      "동영콘텐츠허브",
      "동영수변공원",
      "동영컬처타운",
      "동영스타트업밸리",
      "남부"
    ]
  },
  "서산1호선": {
    "color": [0.6, 0.6, 0.2, 1],
    "stations": [
      "동부서산",
      "서산입구",
      "서산",
      "서산광장",
      "서부서산",
      "서산테크노",
      "서부서평"
    ]
  },
  "서산2호선": {
    "color": [0.2, 0.6, 0.8, 1],
    "stations": [
      "서철",
      "서산공장",
      "서산",
      "서원서부",
      "서원",
      "서폴",
      "서평신도시",
      "서굴",
      "서안"
    ]
  },
  "서산3호선": {
    "color": [0.6, 0.2, 0.8, 1],
    "stations": [
      "서부서산",
      "서산광장",
      "서산",
      "서원서부",
      "서부입구",
      "서산출구",
      "자동농장",
      "폭탄공장",
      "캐럿팜",
      "북신리",
      "민트"
    ]
  },
  "경선1호선": {
    "color": [0.4, 0.2, 0.7, 1],
    "planned": true,
    "stations": [
      "경선플랫폼",
      "경선메트로센터",
      "경선연구단지",
      "경선디지털파크",
      "경선신도심",
      "경선",
      "경선동",
      "경선메디컬파크",
      "경선수변센터",
      "경선터미널",
      "경인지식단지"
    ]
  },
  "경인1호선": {
    "color": [0.1, 0.7, 0.3, 1],
    "planned": true,
    "stations": [
      "경인",
      "경인리버사이드",
      "경인지식단지",
      "경인테크시티",
      "경인창업밸리",
      "경인광역터미널",
      "오류동부"
    ]
  }
};